{
  "home": "Home",
  "about": "About",
  "projects": "Projects",
  "contact": "Contact",
  "hireMe": "Hire Me",

  "availableForHire": "AVAILABLE FOR HIRE",
  "iAm": "I'm a",
  "role1": "Backend Developer",
  "role2": "UI/UX Designer",
  "introText": "I build accessible, pixel-perfect, and performant web experiences associated with creativity and functional design.",
  "viewProjects": "View Projects",
  "viewCV": "View CV",
  "viewAllProjects": "View All Projects",
  "contactMe": "Let's Collaborate",

  "aboutMe": "About Me",
  "aboutText1": "Hello! I'm Alvin Ferina Putra, a passionate developer who bridges the gap between complex backend logic and intuitive user experiences. With a strong foundation in modern web technologies, I specialize in building scalable applications that solve real-world problems.",
  "aboutText2": "I thrive in collaborative environments and am always eager to learn new tools to improve my craft. Whether it's optimizing database queries or tweaking UI animations, I pay attention to every detail.",
  "education": "Education",
  "degree": "Bachelor of Information System",
  "university": "National University • 2023 - 2027",
  "educationDesc": "I specialize in creating reliable apps by fusing a thorough grasp of the Software Development Life Cycle (SDLC) with a strong foundation in programming fundamentals. I concentrate on developing technology-driven business systems that are both strategic and functional, providing users and stakeholders with real value from the first system analysis to implementation.",
  "techStack": "Tech Stack",
  "techStackDesc": "Tools and technologies I use to bring ideas to life",

  "featuredWork": "Featured Work",
  "projectDesc": "Explore a selection of my recent projects, showcasing my expertise in building scalable and user-centric digital solutions.",
  "viewDetails": "View Details",
  "visitSite": "Visit Site",
  "viewProject": "VIEW PROJECT",

  "p1Title": "Sagawa Group",
  "p1Desc": "A corporate website for Sagawa Group utilizing modern web technologies to ensure fast load times and SEO optimization. The platform features a comprehensive company profile, service listings, and a client portal.",
  "p2Title": "G7KAIH - SMKN 31",
  "p2Desc": "An educational portal for SMKN 31 Jakarta, designed to facilitate remote learning and digital administration. Features include student management systems, grade tracking, and announcement boards.",
  "p3Title": "Freelinkd",
  "p3Desc": "Freelinkd offers students real-world work experience through a flexible framework designed to accommodate their academic schedules. It connects students with freelance opportunities tailored to their skills.",
  "p4Title": "AWA Construction",
  "p4Desc": "A robust profile website for a construction firm, showcasing their portfolio of high-rise buildings and infrastructure projects. Includes a dynamic gallery and project inquiry system.",
  "p5Title": "Unyuls",
  "p5Desc": "A creative portfolio template designed for streamer and gamers.",
  "p6Title": "Queue Quest",
  "p6Desc": "Interactive web-based minigames utilized to simulate and model vending machine operations.",

  "startConversation": "Start a Conversation",
  "contactTitle": "Contact Me",
  "contactDesc": "Have a project in mind or just want to chat? Fill out the form below and I'll get back to you as soon as possible.",
  "name": "Name",
  "namePlaceholder": "John Doe",
  "email": "Email",
  "emailPlaceholder": "john@example.com",
  "subject": "Subject",
  "subjectPlaceholder": "Project Inquiry",
  "message": "Message",
  "messagePlaceholder": "Tell me about your project...",
  "sendMessage": "Send Message",

  "statsYears": "Years Experience",
  "statsProjects": "Projects Completed",
  "statsClients": "Satisfied Clients",

  "welcome": "Welcome",
  "language": "Language",
  "selectLanguage": "Select Language",
  "services": "Services",
  "me": "Me",

  "cvTitle": "Curriculum Vitae",
  "cvSummary": "A professional summary of my experience, skills, and background.",
  "downloadPDF": "Download PDF",
  "openNewTab": "Open New Tab",
  "print": "Print",
  "noPDFSupport": "Your browser does not support PDF previews.",

  "myProjects": "My Projects",
  "projectsDesc": "A comprehensive list of my work, featuring full-stack applications, creative designs, and technical experiments.",
  "contributedProjects": "Contributed Projects",
  "contributedDesc": "Open source and team collaborations",
  "contributor": "Contributor",
  "visitWebsite": "Visit Website",
  "technologies": "Technologies",

  "c1Title": "Open Source UI",
  "c1Desc": "Contributed components to a popular UI library.",

  "experimentsTitle": "Experiments",
  "experimentsDesc": "Creative coding, UI prototypes, and mobile app concepts",
  "e1Title": "Neon Login Page",
  "e1Desc": "Futuristic login page with neon animations and glassmorphism effect.",
  "e2Title": "3D Card Hover",
  "e2Desc": "Experimental 3D card hover effects using pure CSS perspective.",
  "e3Title": "Neotreetion",
  "e3Desc": "Daily food recommendation website utilizing algorithm-based suggestions.",
  "e4Title": "SolidJS Personal Web",
  "e4Desc": "My other personal website built with SolidJS.",

  "collegeTasks": "College Tasks",
  "collegeTasksDesc": "Showcase of university assignment projects.",
  "t2Title": "Web SPK Pemilihan Tempat Magang (DUDI)",
  "t2Desc": "Web SPK Pemilihan Tempat Magang (DUDI) menggunakan metode VIKOR."
}
