{
  "home": "Beranda",
  "about": "Tentang",
  "projects": "Proyek",
  "contact": "Kontak",
  "hireMe": "Rekrut Saya",

  "availableForHire": "TERSEDIA UNTUK DIREKRUT",
  "iAm": "Saya seorang",
  "role1": "Backend Developer",
  "role2": "UI/UX Designer",
  "introText": "Saya membangun pengalaman web yang mudah diakses, pixel-perfect, dan berkinerja tinggi yang dipadukan dengan kreativitas dan desain fungsional.",
  "viewProjects": "Lihat Proyek",
  "viewCV": "Lihat CV",
  "viewAllProjects": "Lihat Semua Proyek",
  "contactMe": "Mari Berkolaborasi",

  "aboutMe": "Tentang Saya",
  "aboutText1": "Halo! Saya Alvin Ferina Putra, pengembang yang penuh semangat yang menjembatani logika backend yang kompleks dengan pengalaman pengguna yang intuitif. Dengan dasar yang kuat dalam teknologi web modern, saya mengkhususkan diri dalam membangun aplikasi terukur yang memecahkan masalah dunia nyata.",
  "aboutText2": "Saya berkembang dalam lingkungan kolaboratif dan selalu ingin mempelajari alat baru untuk meningkatkan keahlian saya. Baik itu mengoptimalkan kueri basis data atau menyesuaikan animasi UI, saya memperhatikan setiap detail.",
  "education": "Pendidikan",
  "degree": "Sarjana Sistem Informasi",
  "university": "Universitas Nasional • 2023 - 2027",
  "educationDesc": "Saya berspesialisasi dalam merancang aplikasi tangguh dengan memadukan Dasar Pemrograman (Programming Fundamentals) yang kuat dan pemahaman mendalam tentang Siklus Hidup Pengembangan Perangkat Lunak (SDLC). Mulai dari Analisis Sistem awal hingga deployment, saya fokus menciptakan Sistem Bisnis Berbasis Teknologi yang tidak hanya fungsional tetapi juga strategis, memberikan nilai nyata bagi pengguna dan pemangku kepentingan.",
  "techStack": "Tech Stack",
  "techStackDesc": "Alat dan teknologi yang saya gunakan untuk mewujudkan ide",

  "featuredWork": "Karya Unggulan",
  "projectDesc": "Jelajahi pilihan proyek terbaru saya, yang memamerkan keahlian saya dalam membangun solusi digital yang terukur dan berpusat pada pengguna.",
  "viewDetails": "Lihat Detail",
  "visitSite": "Kunjungi Situs",
  "viewProject": "LIHAT PROYEK",

  "p1Title": "Sagawa Group",
  "p1Desc": "Situs web perusahaan untuk Sagawa Group yang menggunakan teknologi web modern untuk memastikan waktu muat yang cepat dan optimasi SEO. Platform ini menampilkan profil perusahaan yang komprehensif, daftar layanan, dan portal klien.",
  "p2Title": "G7KAIH - SMKN 31",
  "p2Desc": "Portal pendidikan untuk SMKN 31 Jakarta, dirancang untuk memfasilitasi pembelajaran jarak jauh dan administrasi digital. Fitur termasuk sistem manajemen siswa, pelacakan nilai, dan papan pengumuman.",
  "p3Title": "Freelinkd",
  "p3Desc": "Freelinkd menawarkan pengalaman kerja dunia nyata kepada siswa melalui kerangka kerja fleksibel yang dirancang untuk mengakomodasi jadwal akademik mereka. Ini menghubungkan siswa dengan peluang freelance yang disesuaikan dengan keterampilan mereka.",
  "p4Title": "AWA Construction",
  "p4Desc": "Situs web profil yang tangguh untuk perusahaan konstruksi, menampilkan portofolio bangunan bertingkat tinggi dan proyek infrastruktur mereka. Termasuk galeri dinamis dan sistem pertanyaan proyek.",
  "p5Title": "Unyuls",
  "p5Desc": "Template portofolio kreatif yang dirancang untuk desainer dan pengembang.",
  "p6Title": "Queue Quest",
  "p6Desc": "Minigame berbasis web interaktif yang digunakan untuk mensimulasikan dan memodelkan operasi mesin penjual otomatis.",

  "startConversation": "Mulai Percakapan",
  "contactTitle": "Hubungi Saya",
  "contactDesc": "Punya proyek atau hanya ingin mengobrol? Isi formulir di bawah ini dan saya akan segera menghubungi Anda.",
  "name": "Nama",
  "namePlaceholder": "John Doe",
  "email": "Email",
  "emailPlaceholder": "john@example.com",
  "subject": "Subjek",
  "subjectPlaceholder": "Permintaan Proyek",
  "message": "Pesan",
  "messagePlaceholder": "Ceritakan tentang proyek Anda...",
  "sendMessage": "Kirim Pesan",

  "statsYears": "Tahun Pengalaman",
  "statsProjects": "Proyek Diselesaikan",
  "statsClients": "Klien Puas",

  "welcome": "Selamat Datang",
  "language": "Bahasa",
  "selectLanguage": "Pilih Bahasa",
  "services": "Layanan",
  "me": "Saya",

  "cvTitle": "Curriculum Vitae",
  "cvSummary": "Ringkasan profesional pengalaman, keterampilan, dan latar belakang saya.",
  "downloadPDF": "Unduh PDF",
  "openNewTab": "Buka Tab Baru",
  "print": "Cetak",
  "noPDFSupport": "Browser Anda tidak mendukung pratinjau PDF.",

  "myProjects": "Proyek Saya",
  "projectsDesc": "Daftar lengkap pekerjaan saya, menampilkan aplikasi full-stack, desain kreatif, dan eksperimen teknis.",
  "contributedProjects": "Proyek Kontribusi",
  "contributedDesc": "Kolaborasi open source dan tim",
  "contributor": "Kontributor",
  "visitWebsite": "Kunjungi Situs",
  "technologies": "Teknologi",

  "c1Title": "UI Open Source",
  "c1Desc": "Berkontribusi komponen pada library UI populer.",

  "experimentsTitle": "Eksperimen",
  "experimentsDesc": "Creative coding, prototipe UI, dan konsep aplikasi mobile",
  "e1Title": "Halaman Login Neon",
  "e1Desc": "Halaman login futuristik dengan animasi neon dan efek glassmorphism.",
  "e2Title": "Hover Kartu 3D",
  "e2Desc": "Efek hover kartu 3D eksperimental menggunakan perspektif CSS murni.",
  "e3Title": "Neotreetion",
  "e3Desc": "Situs web rekomendasi makanan harian menggunakan saran berbasis algoritma.",

  "collegeTasks": "Tugas Kuliah",
  "collegeTasksDesc": "Pameran proyek tugas universitas.",
  "t2Title": "Web SPK Pemilihan Tempat Magang (DUDI)",
  "t2Desc": "Web SPK Pemilihan Tempat Magang (DUDI) menggunakan metode VIKOR."
}
